Repository: semelyanov86/easywords-native
Catalog: lib/l10n/intl_*.arb
Languages: ru

source: Change Password
ru: Изменить пароль

source: Profile
ru: Страница профиля

source: Settings
ru: Настройки

source: Statistics
ru: Статистика

source: Logout
ru: Выход

source: Profile page
ru: Страница профиля

source: Profile Detail Info
ru: Информация о пользователе

source: Field
ru: Поле

source: Value
ru: Значение

source: Created At
ru: Дата создания

# name
source: User Name
ru: Имя пользователя

source: Updated At
ru: Дата обновления

source: Choose user
ru: Выберите пользователя

# choose_user_helper
source: Please choose user and press save button
ru: Пожалуйста, выберите пользователя и нажмите на кнопку сохранить

# paginate
source: Number of words learn at once
ru: Количество слов, изучаемых за один раз

# default_language
source: Default language to learn
ru: Язык для изучения по умолчанию

# starred_enabled
source: Show only starred
ru: Показывать только избранные

# known_enabled
source: Show known words
ru: Показывать изученные слова

# fresh_first
source: Show fresh first
ru: Показывать сначала слова сортированные по дате создания

# show_imported
source: Show imported words
ru: Показывать импортированные слова

# show_shared
source: Show shared words
ru: Показывать расшаренные слова

source: Latest First
ru: Сначала свежие

# chooseLanguage
source: For starting choose language
ru: Для начала работы выберите направление перевода

# header
source: Translate word
ru: Переведите слово

# headline
source: Start translating words!
ru: Начинайте учить слова!

# headline2
source: Please try to translate word
ru: Вспомните перевод слова

# intro
source: Try to translate word by yourself. Then turn card.
ru: Попробуйте перевести слово самостоятельно. Затем переверните карточку

# no_items
source: No words for learning. Add new words and try to update list.
ru: Нет слов для изучения. Добавьте новые слова или обновите список с сервера

source: Delete
ru: Удалить

# star
source: Add to star
ru: Добавить в избранное

# unstar
source: Remove Star
ru: Удалить из избранного

source: Share
ru: Поделиться

source: Next
ru: Следующий

source: Prev
ru: Предыдущий

# show
source: Turn
ru: Перевернуть

# know
source: Got it!
ru: Выучил!

# unknown
source: Learn Again!
ru: Учить снова!

source: Update words
ru: Обновить слова

# create_header
source: Add to dictionary
ru: Добавить в словать

# short
source: Quick create new word
ru: Быстрое создание нового слова

# fill-data
source: Fill out the form
ru: Пожалуйста, заполните форму

# original
source: Original word
ru: Оригинальное значение слова

# translated
source: Translated word
ru: Перевод слова

# done_at
source: When done
ru: Когда изучено

source: Language
ru: Язык

# views
source: Number of views
ru: Просмотры

source: Save
ru: Сохранить

# statistics_title
source: Personal Analytics
ru: Статистика

# statistics_header
source: Your activity in learning language
ru: Ваша персональная статистика по изучению языков

# all
source: Total number of words
ru: Всего слов

# starred
source: In starred
ru: В избранном

# not_dones
source: Number of not learned words
ru: Количество не изученных

# dones
source: Number of known words
ru: Количество изученных слов

source: Total views
ru: Количество просмотров

# users_count
source: Number of users
ru: Количество пользователей в системе

# updated_this_month
source: Viewed in this month
ru: Просмотренные слова в этом месяце

# updated_today
source: Viewed today
ru: Просмотренные слова сегодня

# most_viewed
source: Most viewed words
ru: Часто просматриваемые слова

source: Added today
ru: Добавлены сегодня

# known_list
source: List of known words
ru: Список изученных слов

source: Go back
ru: Назад

# password_header
source: Change password
ru: Изменить пароль

# password_short
source: Here you can change user password
ru: Здесь можно изменить пароль пользователя

# password_fill-data
source: Fill the form
ru: Заполните форму для добавления

source: Current password
ru: Текущий пароль

# current_password_desc
source: Enter your current password
ru: Введите текущий пароль

# password
source: New password
ru: Новый пароль

# password_desc
source: Enter new password
ru: Введите новый пароль

# password_confirmation
source: Confirm password
ru: Подтвердите пароль

# password_confirmation_desc
source: Please Confirm password
ru: Подтвердите новый пароль

# import_header
source: Do not have time for adding new words? Just import most popular words for your default language!
ru: Лень добавлять слова вручную? Импортируй самые часто используемые слова для языка, выбранного по умолчанию

# import_button
source: Import Words!
ru: Импортировать слова!

# from_sample
source: Word added from samples list
ru: Слово добавлено из списка самых популярных

# from_user
source: Word added from other user
ru: Слово добавлено другим пользователем

# offline_info
source: You are not online. Some information may be outdated.
ru: Вы не в сети. Данные могут быть не актуальны.

# error_marking_viewed
source: There was a connection error when marking this word as viewed
ru: Ошибка при отправке на сервер информации о просмотре слова

# sharing_error
source: There was an error in sharing word. Maybe word already exists.
ru: Ошибка при попытке создать слово для другого пользователя. Скорее всего слово уже существует.

# sharing_error_header
source: Error during sharing
ru: Ошибка создания

# creation_message
source: Created new word with ID:
ru: Создано новое слово с уникальным номером:

# starring_notification
source: Successfully mark starring with ID:
ru: Слово добавлено в избранное с номером:

# starring_error
source: Connection error when trying to mark word as starred:
ru: Ошибка связи с сервером при попытке добавить слово в избранное:

# learned_error
source: Connection error when trying to mark word as learned:
ru: Ошибка связи с сервером при попытке пометить слово изученным:

# delete_error
source: Connection error when trying to delete word:
ru: Ошибка связи с сервером при попытке удалить слово:

# delete_info
source: Word successfully deleted with id:
ru: Карточка удалена с номером:

source: Next Page
ru: Следующая страница

source: First Page
ru: Сначала

source: Submit
ru: Отправить

# validation_error
source: Form is not valid! Please review and correct
ru: Форма заполнена не корректно. Пожалуйста, проверьте правильность заполнения всех полей.

# password_required
source: Current password is required
ru: Пароль нужно указывать обязательно

source: Password does not match
ru: Пароли не совпадают

# password_chars_required
source: 6 character required for password
ru: Длина пароля минимум 6 символов

# password_update_success
source: Password updated successfully
ru: Пароль успешно обновлён

# password_update_error
source: Error in updating password:
ru: Ошибка при обновлении пароля:

# list_all_words
source: List of all words
ru: Список всех слов

source: List known words
ru: Список выученных слов

# list_unknown_words
source: List of not learned words
ru: Список пока ещё не выученных слов

# unexpected_error
source: An error occured, please retry
ru: Неожиданная ошибка, попробуйте снова

# no_results_message
source: That's about everything we could find in your starred repos right now.
ru: Кажется это все слова, которые мы нашли

# mark_done
source: Word make as learned with id:
ru: Слово помечено как изученное с номером:

# mark_undone
source: Word marked as unlearned with id:
ru: Слово удалено из изученных с номером:
